dimitarm1/stm_flash_prj/STM32F0_Discovery_IO_Toggle/src/main.c
	//pre_time_sent = 0, main_time_sent = 0, cool_time_sent = 0;

	if ((data & 0x80)){
		last_rx_address = (data >> 3U)&0x0f;
		unsigned char addr_is_ok = 0;
		addr_is_ok = (last_rx_address == controller_address);
		if (!addr_is_ok) return;
		// Command
		if(addr_is_ok){
			Gv_UART_Timeout = 1500;
		}
		if((data & 0x07) == 0x00 ){ // Status
			data = (curr_status<<6)| ToBCD(curr_time);
//			data = (STATUS_WORKING<<6)|4;
			USART_SendData(USART1,data);
		}
		else if ((data & 0x07) == 1) //Command 1 - Start
		{
			pre_time = 0;
			update_status();
		}
		else if ((data & 0x07) == 2)  //Command 2 == Pre_time_set
		{
			rx_state = rx_state_pre_time;
		}
		else if ((data & 0x07) == 5) //Command 5 == Main_time_set
		{
			rx_state = rx_state_main_time;
		}
		else if ((data & 0x07) == 3) //Command 3 == Cool_time_set
		{
			rx_state = rx_state_cool_time;
		}

	} else if (rx_state){
		// payload
		int time_in_hex = ToBCD(main_time_sent);
		if(rx_state == rx_state_get_checksum){
			int checksum = (pre_time_sent + cool_time_sent  - time_in_hex - 5) & 0x7F;
			if(	data == checksum){
				pre_time = pre_time_sent;
				main_time = main_time_sent;
				cool_time = cool_time_sent;
				if(pre_time == 0 && main_time != 0)start_delay = 2000L;
				update_status();
				Gv_miliseconds = 0;
			}
			rx_state = 0;
		}
		if(rx_state == rx_state_pre_time){
			pre_time_sent = data;
			rx_state = 0;
		}
		if(rx_state == rx_state_main_time){
			main_time_sent = FromBCD(data);
			rx_state = 0;			
		}
		if(rx_state == rx_state_cool_time){
			cool_time_sent = data;
			rx_state = rx_state_get_checksum;
			int checksum = (pre_time_sent + cool_time_sent  - time_in_hex - 5) & 0x7F;
			data = checksum;
			USART_SendData(USART1,data);
		}


	}
	//	USART_ITConfig(USART1,USART_IT_RXNE,ENABLE);
	//	USART_SendData(USART1,0x80);
}





/**
 * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

void set_relay2(char state)
{
	if (state)
	{
		 GPIOA->BSRR = GPIO_BSRR_BS_6 ;
	}
	else
	{
		 GPIOA->BSRR = GPIO_BSRR_BR_6 ;
	}
}
void set_relay1(char state)
{
	if (state && start_delay == 0)
	{
		 GPIOA->BSRR = GPIO_BSRR_BS_15;
	}
	else
	{
		 GPIOA->BSRR = GPIO_BSRR_BR_15;
	}
}


